import 'package:cmzoofv2/Model/animal_model.dart';

List<Poultry> poultry() {
  return <Poultry>[
    new Poultry(
      "img_mammals/koala.jpg",
      "โคอาล่า",
      "Koala",
      Author_P(
          "โคอาล่า",
          "Koala",
          "Phascolarctos cinereus",
          "ขนมีสีเทาถึงน้ำตาลปนเหลือง และมีสีขาวบริเวณคาง หน้าอก ด้านหน้าของแขนและขา ขนบริเวณหูมีลักษณะเป็นปุย และมีขนสีขาวที่ยาวกว่าบริเวณอื่น ตัวเมียจะมีกระเป๋าหน้าท้องเหมือนจิงโจ้ ตัวผู้จะมีต่อมกลิ่นสีน้ำตาลแถบสีขาวตรงหน้าอก",
          "รัฐควีนส์แลนด์ รัฐนิวเซาท์เวลส์ รัฐวิกตอเรีย และรัฐเซาท์ออสเตรเลีย ประเทศออสเตรเลีย",
          "ใบยูคาลิปตัส",
          "โดยปกติโคอาล่าเคลื่อนไหวช้า ใช้เวลานอนถึง 16–24 ชั่วโมงต่อวัน เพื่อรักษาพลังงานไว้",
          "การล่าเป็นภัยคุกคามต่อจำนวนประชากรโคอาล่าในอดีต แต่ในปัจจุบันภัยคุกคามที่สำคัญ ได้แก่ การทำลายที่อยู่อาศัยอย่างต่อเนื่อง ไฟป่า และปัญหาการเปลี่ยนแปลงสภาพภูมิอากาศมีแนวโน้มที่จะส่งผลกระทบอย่างรุนแรงต่อสัตว์ชนิดนี้",
          "โตเต็มวัยอายุ 2-3 ปี อายุเฉลี่ย 13–20 ปี",
          "ตัวเมียเริ่มเข้าสู่วัยเจริญพันธุ์เมื่ออายุ 3 - 4 ปี ฤดูการสืบพันธุ์อยู่ในช่วงกันยายน ถึง มีนาคม ใช้เวลาตั้งท้องประมาณ 34–36 วัน มักมีลูกปีละ 1 ตัว",
          "โคอาลาที่อยู่ทางตอนใต้จะมีขนาดใหญ่กว่าที่อื่น โดยตัวผู้สูงเฉลี่ย 78 เซนติเมตร น้ำหนักเฉลี่ย 11.8 กิโลกรัม ตัวเมียสูงเฉลี่ย 72 เซนติเมตร น้ำหนักเฉลี่ย 7.9 กิโลกรัม โคอาลาที่อยู่ทางตอนเหนือ ตัวผู้มีน้ำหนักเฉลี่ย 6.5 กิโลกรัม ตัวเมียมีน้ำหนักเฉลี่ย 5.1 กิโลกรัม",
          "สวนสัตว์เชียงใหม่ 6 ตัว"),
    ),
  ];
}
