class AnimalData {
  String animalName;
  String animalEngname;
  String animalImg;
  String animalType;
  int animalNum;

  AnimalData(this.animalImg, this.animalName, this.animalEngname,
      this.animalType, this.animalNum);
}

List<AnimalData> rareanimal() {
  return <AnimalData>[
    new AnimalData("img_animal/panda.jpg", "แพนด้า", "Panda", "", 0),
    new AnimalData(
        "img_animal/chineseserow.jpg", "เลียงผาเหนือ", "Chinese Serow", "", 0),
    new AnimalData("img_mammals/koala.jpg", "โคอาล่า", "Koala", "", 0),
    new AnimalData(
        "img_mammals/orangutan.jpg", "ลิงอุรังอุตัง", "Orang-Utan", "", 0),
  ];
}

class AnimalType {
  String typeanimal;
  String typeImg;

  AnimalType(
    this.typeImg,
    this.typeanimal,
  );
}

List<AnimalType> type() {
  return <AnimalType>[
    new AnimalType("img_animal/rhesusmacaque.jpg", "สัตว์เลี้ยงลูกด้วยนม"),
    new AnimalType("img_animal/commoncaiman.jpg", "สัตว์เลื้อยคลาน"),
    new AnimalType("img_animal/commonostrich.jpg", "สัตว์ปีก"),
    new AnimalType("img_animal/africanbullfrog.jpg", "สัตว์สะเทินน้ำสะเทินบก"),
  ];
}

class Mammals {
  String mammalsImg;
  String mammalsname;
  Author author;
  String mammalsnameENG;

  Mammals(this.mammalsImg, this.mammalsname, this.mammalsnameENG, this.author);
}

List<Mammals> mammal() {
  return <Mammals>[
    new Mammals(
      "img_mammals/koala.jpg",
      "โคอาล่า",
      "Koala",
      Author(
          "โคอาล่า",
          "Koala",
          "Phascolarctos cinereus",
          "ขนมีสีเทาถึงน้ำตาลปนเหลือง และมีสีขาวบริเวณคาง หน้าอก ด้านหน้าของแขนและขา ขนบริเวณหูมีลักษณะเป็นปุย และมีขนสีขาวที่ยาวกว่าบริเวณอื่น ตัวเมียจะมีกระเป๋าหน้าท้องเหมือนจิงโจ้ ตัวผู้จะมีต่อมกลิ่นสีน้ำตาลแถบสีขาวตรงหน้าอก",
          "รัฐควีนส์แลนด์ รัฐนิวเซาท์เวลส์ รัฐวิกตอเรีย และรัฐเซาท์ออสเตรเลีย ประเทศออสเตรเลีย",
          "ใบยูคาลิปตัส",
          "โดยปกติโคอาล่าเคลื่อนไหวช้า ใช้เวลานอนถึง 16–24 ชั่วโมงต่อวัน เพื่อรักษาพลังงานไว้",
          "การล่าเป็นภัยคุกคามต่อจำนวนประชากรโคอาล่าในอดีต แต่ในปัจจุบันภัยคุกคามที่สำคัญ ได้แก่ การทำลายที่อยู่อาศัยอย่างต่อเนื่อง ไฟป่า และปัญหาการเปลี่ยนแปลงสภาพภูมิอากาศมีแนวโน้มที่จะส่งผลกระทบอย่างรุนแรงต่อสัตว์ชนิดนี้",
          "โตเต็มวัยอายุ 2-3 ปี อายุเฉลี่ย 13–20 ปี",
          "ตัวเมียเริ่มเข้าสู่วัยเจริญพันธุ์เมื่ออายุ 3 - 4 ปี ฤดูการสืบพันธุ์อยู่ในช่วงกันยายน ถึง มีนาคม ใช้เวลาตั้งท้องประมาณ 34–36 วัน มักมีลูกปีละ 1 ตัว",
          "โคอาลาที่อยู่ทางตอนใต้จะมีขนาดใหญ่กว่าที่อื่น โดยตัวผู้สูงเฉลี่ย 78 เซนติเมตร น้ำหนักเฉลี่ย 11.8 กิโลกรัม ตัวเมียสูงเฉลี่ย 72 เซนติเมตร น้ำหนักเฉลี่ย 7.9 กิโลกรัม โคอาลาที่อยู่ทางตอนเหนือ ตัวผู้มีน้ำหนักเฉลี่ย 6.5 กิโลกรัม ตัวเมียมีน้ำหนักเฉลี่ย 5.1 กิโลกรัม",
          "สวนสัตว์เชียงใหม่ 6 ตัว"),
    ),
    new Mammals(
      "img_mammals/rhesusmacaque.jpg",
      "ลิงวอก",
      "Rhesus Macaque",
      Author(
          "ลิงวอก",
          "Rhesus Macaque",
          "Macaca mulatta",
          "ลำตัวส่วนหลังสีน้ำตาล ส่วนอื่นเป็นสีน้ำตาลเทา หางสั้นประมาณครึ่งหนึ่งของลำตัว โคนหางค่อนข้างใหญ่และเรียวเล็กลงไปทางปลายหาง แต่หางสั้นกว่าลิงแสม ขนบริเวณสองข้างแก้มม้วนวนเป็นก้นหอย",
          "พนในประเทศไทย พม่า อินเดีย อัสสัม เนปาล อัฟกานิสถาน จีน และอินโดจีน ในประเทศไทยพบทางภาคเหนือ",
          "กินผัก ผลไม้ ใบไม้อ่อน แมลงต่างๆ รวมทั้งสัตว์เล็กๆ",
          "เป็นลิงที่ชอบอยู่รวมกันเป็นฝูงใหญ่ มีตัวผู้แก่เป็นจ่าฝูง ชอบอยู่ตามป่าที่มีโขดหิน หรือหน้าผาและเป็นป่าที่ค่อนข้างแห้งแล้ง ออกหากินบริเวณใกล้เคียงกับที่อาศัย ชอบลงมาเดินบนพื้นดิน เป็นลิงที่เชื่องและไม่ค่อยกลัวคน",
          "สิ่งมีชีวิตที่มีความเสี่ยงต่ำต่อการสูญพันธุ์",
          "ลิงวอกเริ่มผสมพันธุ์ได้เมื่อมีอายุ 3-4 ปี ระยะตั้งท้องนาน 5-7 เดือน ออกลูกครั้งละ 1 ตัว",
          "ไม่ทราบข้อมูล",
          "ไม่ทราบข้อมูล",
          "สวนสัตว์เชียงใหม่ 19 ตัว"),
    ),
    new Mammals(
      "img_mammals/spotteddeer.jpg",
      "กวางดาว",
      "Spotted Deer",
      Author(
          "กวางดาว",
          "Spotted Deer",
          "Axis axis",
          "เป็นกวางที่มีขนาดกลางมีขนสีน้ำตาลแดงมีจุดสีขาวเรียงเป็นลายข้างตัวให้ความ สวยงามและสะดุดตากลางหลังมีแถบสีดำทอดเป็นแนวยาวไปถึงโคนหาง",
          "อินเดีย ศรีลังกา บังกลาเทศ ภูฐาน ปากีสถาน",
          "หญ้า ใบไม้ และเปลือกไม้",
          "ไม่ทราบข้อมูล",
          "ไม่ทราบข้อมูล",
          "โตเต็มวัย เพศเมียอายุ 14-17 เดือน, เพศผู้ 30 เดือน -อายุขัยเฉลี่ย 15-20 ปี",
          "ฤดูผสมพันธุ์ระหว่างเดือนเมษายน- พฤษภาคม -ตั้งท้องนาน 7- 8 เดือน -ออกลูกครั้งละ1-3 ตัว",
          "เพศผู้หนักเฉลี่ย 30-75 กิโลกรัม เพศเมียมีหนักเฉลี่ย 25-45 กิโลกรัม",
          "สวนสัตว์เชียงใหม่ 73 ตัว"),
    ),
    new Mammals(
      "img_mammals/capybara.jpg",
      "คาปิยารา",
      "Capybara",
      Author(
          "คาปิยารา",
          "Capybara",
          "Hydrochoerus hydrochaeris",
          "เป็นสัตว์ฟันแทะที่มีขนาดใหญ่ที่สุด ขนสีน้ำตาลแดง หรือสีเทา ไม่มีหาง เพศเมียจะมีขนาดใหญ่กว่าเพศผู้เล็กน้อย น้ำหนักระหว่าง 35-66 กิโลกรัม",
          "ทวีปอเมริกาใต้",
          "กินพืช โดยเฉพาะส่วนใบ และเปลือกไม้ (Herbivore, Folivore, Lignivore)",
          "ผสมพันธุ์ได้ตลอดทั้งปี มีวงรอบผสมพันธุ์ปีละครั้ง มักพบการผสมพันธุ์ก่อนเข้าฤดูฝน -ตั้งท้องนาน 130-150 วัน -ออกลูกครั้งละ 4-5 ตัว",
          "สิ่งมีชีวิตที่มีความเสี่ยงต่ำต่อการสูญพันธุ์",
          "โตเต็มวัย อายุ 18 เดือน -อายุขัยเฉลี่ย 6-12 ปี",
          "ไม่ทราบข้อมูล",
          "ไม่ทราบข้อมูล",
          "สวนสัตว์เชียงใหม่ 1 ตัว"),
    ),
    new Mammals(
      "img_mammals/burchellzebra.jpg",
      "ม้าลายเบอร์เชล",
      "Burchell Zebra",
      Author(
          "ม้าลายเบอร์เชล",
          "Burchell Zebra",
          "Equus quagga",
          "ม้าลายเบอร์เชลล์มีชื่อวิทยาศาสตร์ว่า Equus quagga นั้นเป็นสัตว์ที่พบได้ทั่วไปและเป็นสัตว์ที่มีความ สง่างามในบรรดาสัตว์แอฟริกาทั้งหมด ม้าลายในสายพันธุ์นี้มักจะอาศัยอยู่ตามแหล่งธรรมชาติหลายแห่ง และในปัจจุบันมีการแยกแยะความแตกต่างของม้าลายสายพันธุ์นี้ออกจากม้าลายทั้งหกสายพันธุ์ในด้านตัวแปรเชิงลักษณะ เช่น รูปแบบสีผิวหนัง ลักษณะแผงคอม้า ลวดลายที่ปกคลุมอยู่ และขนาดของลำตัว โดยทั่วไปสัตว์ชนิดนี้จะมีลายคาดเป็นสีดำขนาดกว้างซึ่งจะเรียงตามแนวยาวของลำตัว และมีลายคาดในแนวดิ่ง บริเวณส่วนหลัง ลายคาดในแนวดิ่งนั้นมักจะพบได้ที่ขา และสะโพก แต่ในม้าลายเบอร์เชลล์สายพันธุ์ทางตอนเหนือนั้นจะพบลายคาดที่ขาได้น้อยกว่า ม้าลายเบอร์เชลล์สายพันธุ์ทางตอนใต้ ในสัตว์บางตัวอาจจะพบลายคาดมากขึ้นตามลำตัวซึ่งมีหลายทฤษฎีที่อธิบายเอาไว้ว่าการมีลวดลายบนลำตัวของม้าลายนั้นช่วยในการสะท้อนแสงเพื่อป้องกันศัตรูและใช้ในการควบคุมอุณหภูมิ แต่ทฤษฎีที่เป็นไปได้มากที่สุดก็คือการมีลวดลายบนลำตัวของม้าลายเพื่อการเข้าสังคมโดยการรวมกลุ่มกัน และเพื่อความสวยงาม นอกจากนี้ ยังมีวิธีอื่นที่",
          "ทางตอนใต้ของประเทศซูดาน ทางตอนใต้ของเอธิโอเปีย แอฟริกาตะวันออก โมซัมบิกและมาลาวี และแอฟริการตอนใต้ ทุ่งหญ้าซาวันนา สูงจากระดับน้ำทะเล 4,300 เมตร ม้าลายเบอร์เชลล์ สามารถอยู่ได้ในพื้นที่แห้งแล้งมีอาหารน้อยแต่พื้นที่นั้น ๆ ต้องมีแหล่งน้ำ เพราะมันต้องการกินน้ำทุกวัน",
          "ม้าลายเบอร์เชลชอบเล็มหญ้า สมุนไพร ใบไม้ และกิ่งไม้ ส่วนใหญ่ 90% ของอาหารมาจากเปลือกของลำต้น และหญ้าสั้น",
          "ชอบอาศัยอยู่รวมกันเป็นฝูงใหญ่ตามที่ราบโล่งที่เป็นทุ่งหญ้า โดยจะเล็มหญ้าหากินร่วมกับสัตว์อื่น เช่น นกกระจอกเทศ ยีราฟ และสัตว์อื่นๆ",
          "สิ่งมีชีวิตที่มีความเสี่ยงต่ำต่อการสูญพันธุ์",
          "ไม่ทราบข้อมูล",
          "ม้าลายเบอร์เชลสามารถผสมพันธุ์ได้ตลอดทั้งปี ออกลูกช่วงหน้าฝน ตั้งท้องนาน 360-396 วัน ลูกม้าลายสามารถยืนและเริ่มกินหญ้าได้ หลังจากคลอด 1 อาทิตย์ และหย่านม 7-11 เดือน จะเริ่มเข้าสู่ช่วงวัยรุ่นเมื่ออายุได้ 16-22 เดือน",
          "ความยาวตั้งแต่หัวถึงลำตัว คือ 217 - 246 เซนติเมตร ความสูงถึงหัวไหล่คือ 110 - 145 เซนติเมตร มีน้ำหนัก 175 - 385 กิโลกรัม",
          "สวนสัตว์เชียงใหม่ 2 ตัว"),
    ),
    new Mammals(
      "img_mammals/orangutan.jpg",
      "ลิงอุรังอุตัง",
      "Orang-utan",
      Author(
          "ลิงอุรังอุตัง",
          "Orang-utan",
          "Pongo pygmaeus",
          "เป็นลิงที่มีรูปร่างคล้ายคน ไม่มีหาง แขนยาวแต่ขาสั้นและค่อนข้างเล็ก มีขนยาวหยาบรุงรังสีน้ำตาลแดง หูเล็กมากเมื่อเทียบกับของชิมแปนซีและกอริลล่า ตัวผู้จะมีถุงลมใต้คอหอยขนาดใหญ่ เมื่อมันโตเป็นหนุ่มเต็มตัว กระพุ้งแก้มจะเจริญห้อยย้อยเป็นถุงขนาดใหญ่เห็นได้ชัด คำว่า “อุรังอุตัง” เป็นภาษามลายู มีความหมายว่า “คนป่า” ลิงอุรังอุตังมี 2 พันธุ์ คือ พันธุ์สุมาตราและพันธุ์บอร์เนียว",
          "พบตามป่าร้อนชื้นของเกาะบอร์เนียว และเกาะสุมาตรา",
          "อาหารหลักในธรรมชาติของมันได้แก่ผลไม้ป่าชนิดต่าง ๆ โดยเฉพาะพวกที่มีรสขมและเปรี้ยวจะชอบมาก ตาอ่อนของพืช ใบไม้กิ่งไม้สด ๆ และยังกินพวกแมลง ไข่นก จิ้งจก สัตว์เล็กอื่น ๆ ได้อีกด้วย ทุเรียนเป็นผลไม้ชนิดหนึ่งที่ลิงอุรังอุตังชอบมาก",
          "ชอบอาศัยอยู่บนต้นไม้ และเคลื่อนที่ไปโดยการห้อยโหนโยนตัวจากกิ่งหนึ่งไปอีกกิ่ง กินน้ำโดยใช้ปากก้มลงดื่มโดยตรง ไม่ใช้หลังมือจุ่มน้ำขึ้นมากินอย่างชะนี เวลาลงมาบนพื้นดินส่วนใหญ่จะใช้ทั้ง 4 ขาในการเคลื่อนไหว แต่บางทีก็ใช้ 2 ขา ปกติเราจะพบมันชอบอยู่กันเป็นฝูง ๆ มีการสร้าง “รังนอน” บนคบคาไม้ได้เช่นเดียวกับชิมแปนซี มีนิสัยเชื่อง ไม่ดุ แต่เมื่ออายุมากมักดุอาจมีอันตรายจึงไม่ควรไว้ใจ ปกติลิงอุรังอุตังตัวผู้จะอยู่ตัวเดียว ไม่ยุ่งเกี่ยวกับตัวเมีย",
          "ไม่ทราบข้อมูล",
          "อายุยืนถึง 40 ปี",
          "นอกจากระยะผสมพันธุ์ และไม่สนใจเกี่ยวกับครอบครัวของตน ลิงอุรังอุตังจะโตเป็นหนุ่มสาวพร้อม ผสมพันธุ์ได้เมื่อมีอายุ 10 ปี ตั้งท้องนานประมาณ 250–275 วัน ออกลูกครั้งละ 1 ตัว ลูกจะหย่านมแม่เมื่ออายุประมาณปีครึ่ง เป็นสัดทุก ๆ 23–39 วัน แต่ละครั้งเป็นนาน 3–4 วัน ลูกจะแยกจากแม่เด็ดขาดเมื่ออายุราว 4 ปี",
          "มีขนาดใหญ่ตัวผู้หนัก 75–100 กิโลกรัม ตัวเมียหนัก 45–68 กิโลกรัม",
          "สวนสัตว์เชียงใหม่ 1 ตัว"),
    ),
  ];
}

class Author {
  String name;
  String nameEng;
  String nameSci;
  String interestingthing;
  String habitat;
  String food;
  String behavior;
  String currentstatus;
  String ageavg;
  String reproductiveage;
  String sizeandweight;
  String placetowatch;
  Author(
      this.name,
      this.nameEng,
      this.nameSci,
      this.interestingthing,
      this.habitat,
      this.food,
      this.behavior,
      this.currentstatus,
      this.ageavg,
      this.reproductiveage,
      this.sizeandweight,
      this.placetowatch);
}
